In [1]:
# b = open('<file_name>','<Modes>')
# b.close()

# with open('<file_name>','<Modes>') as file:
#         <operator>

In [2]:
# modes
## read ->r
## write ->w
## create ->x
## append ->a

In [3]:
# Create Mode
file = open('data.txt','x')
file.close()

In [9]:

file = open('data.txt','r')
print(file.read())
file.close()

1. I am Groot
2. I am Groot
3. I am Groot

In [8]:
# Read Mode
file = open('data.txt','r')
x = file.read()
print(x)
file.close()

1. I am Groot
2. I am Groot
3. I am Groot

In [10]:
x.split('\n')

['1. I am Groot', '2. I am Groot', '3. I am Groot']

In [11]:
# Writing Mode
file = open('data.txt','w')
file.write('Hello world')
file.close()

In [17]:
file = open('data.txt','w')
file.write("MUJI")
file.close()

In [14]:
s = ""
n = int(input("Enter the value of n = "))
for i in range(n):
    product = input("Enter the product name = ")
    price = int(input("Enter the price = "))
    quantity = int(input("Enter the quantity = "))
    total = price*quantity
    info = f"{product} {price} {quantity} {total}\n"
    s = s + info
print(s)

file = open('bill.txt','w')
file.write(s)
file.close()

Enter the value of n = 2
Enter the product name = Apple
Enter the price = 200
Enter the quantity = 2
Enter the product name = banana
Enter the price = 100
Enter the quantity = 3
Apple 200 2 400
banana 100 3 300

In [19]:
s = ""
file = open('bill.txt','a')
n = int(input("Enter the value of n = "))
for i in range(n):
    product = input("Enter the product name = ")
    price = int(input("Enter the price = "))
    quantity = int(input("Enter the quantity = "))
    total = price*quantity
    info = f"{product} {price} {quantity} {total}\n"
    file.write(info)

file.close()

Enter the value of n = 2
Enter the product name = fanta
Enter the price = 300
Enter the quantity = 2
Enter the product name = Coke
Enter the price = 200
Enter the quantity = 2

In [28]:
file = open('bill.txt','r')
x = file.read()
y = x.split('\n')[:-1]
y

['Coke 200 2 400', 'Chips 100 4 400', 'fanta 300 2 600', 'Coke 200 2 400']

In [33]:
file = open('bill.txt','r')
x = file.read()
y = x.split('\n')
y

['Coke 200 2 400', 'Chips 100 4 400', 'fanta 300 2 600', 'Coke 200 2 400', '']

In [35]:
net = []
for i in y:
    net.append(i.split())
net

[['Coke', '200', '2', '400'],
 ['Chips', '100', '4', '400'],
 ['fanta', '300', '2', '600'],
 ['Coke', '200', '2', '400'],
 []]

In [36]:
s = ""
n = int(input("Enter the value of n = "))
for i in range(n):
    product = input("Enter the product name = ")
    price = int(input("Enter the price = "))
    quantity = int(input("Enter the quantity = "))
    total = price*quantity
    info = f"{product},{price},{quantity},{total}\n"
    s = s + info
print(s)

file = open('bill.csv','w')
file.write(s)
file.close()

Enter the value of n = 2
Enter the product name = Coke
Enter the price = 200
Enter the quantity = 2
Enter the product name = Chips
Enter the price = 200
Enter the quantity = 1
Coke,200,2,400
Chips,200,1,200

In [37]:
pwd

'C:\\Users\\suraj\\Python Training'

In [1]:
file = open('data.csv','x')
file.close()

In [3]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn       name  age    adddress
0   1      Suraj   20   Narephate
1   2  ghanshyam   43    jadibuti
2   3    baburam   67  koteshwore
3   4     shyaam   34      boudha
4   5     fakira   45    kamaltar

In [5]:
import pandas as pd
df = pd.read_csv('data.csv')
df.head(3)  # Head function()

   sn       name  age    adddress
0   1      Suraj   20   Narephate
1   2  ghanshyam   43    jadibuti
2   3    baburam   67  koteshwore

In [6]:
df.tail(3)   # tail function()

   sn     name  age    adddress
2   3  baburam   67  koteshwore
3   4   shyaam   34      boudha
4   5   fakira   45    kamaltar

In [7]:
!pip install pandas #imp

Requirement already satisfied: pandas in c:\users\suraj\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\suraj\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\suraj\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\suraj\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\users\suraj\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [9]:

df = pd.read_csv('data.csv',index_col = 'sn')
df

         name  age    adddress
sn
1       Suraj   20   Narephate
2   Ghanshyam   43    Jadibuti
3     Baburam   67  Koteshwore
4      Shyaam   34      Boudha
5      Fakira   45    Kamaltar

In [12]:
df = pd.read_csv('data.csv',index_col = 'sn',usecols = ['sn','name','age'])
df # data frame

         name  age
sn
1       Suraj   20
2   Ghanshyam   43
3     Baburam   67
4      Shyaam   34
5      Fakira   45

In [17]:
# iloc and loc
df.iloc[3]

name    Shyaam
age         34
Name: 4, dtype: object

In [18]:
df = pd.read_csv('data.csv',index_col = 'name')
df

           sn  age    adddress
name
Suraj       1   20   Narephate
Ghanshyam   2   43    Jadibuti
Baburam     3   67  Koteshwore
Shyaam      4   34      Boudha
Fakira      5   45    Kamaltar

In [20]:
df.iloc[0:3]

           sn  age    adddress
name
Suraj       1   20   Narephate
Ghanshyam   2   43    Jadibuti
Baburam     3   67  Koteshwore

In [23]:
df = pd.read_csv('data.csv',index_col = 'name')
df.loc['Suraj':'Baburam']

           sn  age    adddress
name
Suraj       1   20   Narephate
Ghanshyam   2   43    Jadibuti
Baburam     3   67  Koteshwore

In [28]:
df = pd.read_csv('data.csv',index_col = 'sn')
df[df['age'] > 40]
df.to_csv('new_data.csv')

In [35]:
import pandas as pd
df = pd.read_csv('data.csv')
df

   sn       name  age    adddress
0   1      Suraj   20   Narephate
1   2  Ghanshyam   43    Jadibuti
2   3    Baburam   67  Koteshwore
3   4     Shyaam   34      Boudha
4   5     Fakira   45    Kamaltar

In [40]:
data = {'name':['Hari','Ram','Shyam','Krishna'],
       'age':[45,65,43,68],
       'add': ['Kathmandu','Biratnagar','Kamaltar','Baisepati']}
df = pd.DataFrame(data)
df.to_csv('info.csv')
df

      name  age         add
0     Hari   45   Kathmandu
1      Ram   65  Biratnagar
2    Shyam   43    Kamaltar
3  Krishna   68   Baisepati

In [47]:
data = [['Name','Age','Add'],
       ['Ram',34,'Kathmandu'],
       ['Shyam',65,'Biratnagar'],
       ['Ghanshyam',78,'Kavre']]
import csv
file = open('list_data.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [48]:
df = pd.read_csv('list_data.csv')
df

        Name  Age         Add
0        Ram   34   Kathmandu
1      Shyam   65  Biratnagar
2  Ghanshyam   78       Kavre